#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/x21129924-devopssec/DevOps_project-Workspace/runs/run-LotBbxgSgS2ZNSqF

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_elastic_beanstalk_application.eb_app: Refreshing state... [id=eb-tf-app]
aws_s3_bucket.eb_bucket: Refreshing state... [id=eb-python-gsingh-new]
aws_s3_bucket_object.eb_bucket_obj: Refreshing state... [id=beanstalk/app.zip]
aws_elastic_beanstalk_application_version.eb_app_ver: Refreshing state... [id=eb-tf-app-version-lable]
aws_elastic_beanstalk_environment.tfenv: Refreshing state... [id=e-7cmu2vexj5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_elastic_beanstalk_environment.tfenv has been deleted
  - resource "aws_elastic_beanstalk_environment" "tfenv" {
      - all_settings           = [
          - {
              - name      = "AppSource"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "https://elasticbeanstalk-platform-assets-us-east-1.s3.amazonaws.com/stalks/eb_python37_amazon_linux_2_1.0.2003.0_20220328181349/sampleapp/EBSampleApp-Python.zip"
            },
          - {
              - name      = "Application Healthcheck URL"
              - namespace = "aws:elasticbeanstalk:application"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "AssociatePublicIpAddress"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Automatically Terminate Unhealthy Instances"
              - namespace = "aws:elasticbeanstalk:monitoring"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "Availability Zones"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "Any"
            },
          - {
              - name      = "BatchSize"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "100"
            },
          - {
              - name      = "BatchSizeType"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "Percentage"
            },
          - {
              - name      = "BlockDeviceMappings"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "BreachDuration"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "ConfigDocument"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = jsonencode(
                    {
                      - CloudWatchMetrics = {
                          - Environment = {
                              - ApplicationLatencyP10     = null
                              - ApplicationLatencyP50     = null
                              - ApplicationLatencyP75     = null
                              - ApplicationLatencyP85     = null
                              - ApplicationLatencyP90     = null
                              - ApplicationLatencyP95     = null
                              - ApplicationLatencyP99     = null
                              - "ApplicationLatencyP99.9" = null
                              - ApplicationRequests2xx    = null
                              - ApplicationRequests3xx    = null
                              - ApplicationRequests4xx    = null
                              - ApplicationRequests5xx    = null
                              - ApplicationRequestsTotal  = null
                              - InstancesDegraded         = null
                              - InstancesInfo             = null
                              - InstancesNoData           = null
                              - InstancesOk               = null
                              - InstancesPending          = null
                              - InstancesSevere           = null
                              - InstancesUnknown          = null
                              - InstancesWarning          = null
                            }
                          - Instance    = {
                              - ApplicationLatencyP10     = null
                              - ApplicationLatencyP50     = null
                              - ApplicationLatencyP75     = null
                              - ApplicationLatencyP85     = null
                              - ApplicationLatencyP90     = null
                              - ApplicationLatencyP95     = null
                              - ApplicationLatencyP99     = null
                              - "ApplicationLatencyP99.9" = null
                              - ApplicationRequests2xx    = null
                              - ApplicationRequests3xx    = null
                              - ApplicationRequests4xx    = null
                              - ApplicationRequests5xx    = null
                              - ApplicationRequestsTotal  = null
                              - CPUIdle                   = null
                              - CPUIowait                 = null
                              - CPUIrq                    = null
                              - CPUNice                   = null
                              - CPUSoftirq                = null
                              - CPUSystem                 = null
                              - CPUUser                   = null
                              - InstanceHealth            = null
                              - LoadAverage1min           = null
                              - LoadAverage5min           = null
                              - RootFilesystemUtil        = null
                            }
                        }
                      - Version           = 1
                    }
                )
            },
          - {
              - name      = "ConnectionDrainingEnabled"
              - namespace = "aws:elb:policies"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "ConnectionDrainingTimeout"
              - namespace = "aws:elb:policies"
              - resource  = ""
              - value     = "20"
            },
          - {
              - name      = "ConnectionSettingIdleTimeout"
              - namespace = "aws:elb:policies"
              - resource  = ""
              - value     = "60"
            },
          - {
              - name      = "Cooldown"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "360"
            },
          - {
              - name      = "CrossZone"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "Custom Availability Zones"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "DefaultSSHPort"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "22"
            },
          - {
              - name      = "DeleteOnTerminate"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "DeleteOnTerminate"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "DeploymentPolicy"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "AllAtOnce"
            },
          - {
              - name      = "DisableIMDSv1"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "EC2KeyName"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ELBScheme"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = "public"
            },
          - {
              - name      = "ELBSubnets"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "EnableCapacityRebalancing"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "EnableSpot"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "EnhancedHealthAuthEnabled"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "EnvironmentType"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "LoadBalanced"
            },
          - {
              - name      = "EnvironmentVariables"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "PYTHONPATH=/var/app/venv/staging-LQM1lest/bin"
            },
          - {
              - name      = "EvaluationPeriods"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "ExternalExtensionsS3Bucket"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ExternalExtensionsS3Key"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "HasCoupledDatabase"
              - namespace = "aws:rds:dbinstance"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "HealthCheckSuccessThreshold"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = "Ok"
            },
          - {
              - name      = "HealthStreamingEnabled"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "HealthyThreshold"
              - namespace = "aws:elb:healthcheck"
              - resource  = ""
              - value     = "3"
            },
          - {
              - name      = "HooksPkgUrl"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "https://elasticbeanstalk-platform-assets-us-east-1.s3.amazonaws.com/stalks/eb_python37_amazon_linux_2_1.0.2003.0_20220328181349/lib/hooks.tar.gz"
            },
          - {
              - name      = "IamInstanceProfile"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "aws-elasticbeanstalk-ec2-role"
            },
          - {
              - name      = "IgnoreHealthCheck"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "ImageId"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "ami-081fa14a6fc82013c"
            },
          - {
              - name      = "InstancePort"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "80"
            },
          - {
              - name      = "InstancePort"
              - namespace = "aws:elb:listener:80"
              - resource  = ""
              - value     = "80"
            },
          - {
              - name      = "InstanceProtocol"
              - namespace = "aws:elb:listener:80"
              - resource  = ""
              - value     = "HTTP"
            },
          - {
              - name      = "InstanceRefreshEnabled"
              - namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "InstanceType"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "t2.micro"
            },
          - {
              - name      = "InstanceTypeFamily"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "t2"
            },
          - {
              - name      = "InstanceTypes"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "t2.micro, t2.small"
            },
          - {
              - name      = "Interval"
              - namespace = "aws:elb:healthcheck"
              - resource  = ""
              - value     = "10"
            },
          - {
              - name      = "LaunchTimeout"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "0"
            },
          - {
              - name      = "LaunchType"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "Migration"
            },
          - {
              - name      = "ListenerEnabled"
              - namespace = "aws:elb:listener:80"
              - resource  = ""
              - value     = "true"
            },
          - {
              - name      = "ListenerProtocol"
              - namespace = "aws:elb:listener:80"
              - resource  = ""
              - value     = "HTTP"
            },
          - {
              - name      = "LoadBalancerHTTPPort"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = "80"
            },
          - {
              - name      = "LoadBalancerHTTPSPort"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = "OFF"
            },
          - {
              - name      = "LoadBalancerPortProtocol"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = "HTTP"
            },
          - {
              - name      = "LoadBalancerSSLPortProtocol"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = "HTTPS"
            },
          - {
              - name      = "LoadBalancerType"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "classic"
            },
          - {
              - name      = "LogPublicationControl"
              - namespace = "aws:elasticbeanstalk:hostmanager"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "LowerBreachScaleIncrement"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "-1"
            },
          - {
              - name      = "LowerThreshold"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "2000000"
            },
          - {
              - name      = "ManagedActionsEnabled"
              - namespace = "aws:elasticbeanstalk:managedactions"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "MaxBatchSize"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "MaxSize"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "4"
            },
          - {
              - name      = "MeasureName"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "NetworkOut"
            },
          - {
              - name      = "MinInstancesInService"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "MinSize"
              - namespace = "aws:autoscaling:asg"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "MonitoringInterval"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "5 minute"
            },
          - {
              - name      = "Notification Endpoint"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Notification Protocol"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = "email"
            },
          - {
              - name      = "Notification Topic ARN"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Notification Topic Name"
              - namespace = "aws:elasticbeanstalk:sns:topics"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "NumProcesses"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "NumThreads"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "15"
            },
          - {
              - name      = "PYTHONPATH"
              - namespace = "aws:elasticbeanstalk:application:environment"
              - resource  = ""
              - value     = "/var/app/venv/staging-LQM1lest/bin"
            },
          - {
              - name      = "PauseTime"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Period"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "PreferredStartTime"
              - namespace = "aws:elasticbeanstalk:managedactions"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ProxyServer"
              - namespace = "aws:elasticbeanstalk:environment:proxy"
              - resource  = ""
              - value     = "nginx"
            },
          - {
              - name      = "RetentionInDays"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs"
              - resource  = ""
              - value     = "7"
            },
          - {
              - name      = "RetentionInDays"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
              - resource  = ""
              - value     = "7"
            },
          - {
              - name      = "RollbackLaunchOnFailure"
              - namespace = "aws:elasticbeanstalk:control"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "RollingUpdateEnabled"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "RollingUpdateType"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = "Time"
            },
          - {
              - name      = "RootVolumeIOPS"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "RootVolumeSize"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "RootVolumeThroughput"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "RootVolumeType"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SSHSourceRestriction"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = "tcp,22,22,0.0.0.0/0"
            },
          - {
              - name      = "SSLCertificateId"
              - namespace = "aws:elb:listener:80"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SSLCertificateId"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SecurityGroups"
              - namespace = "aws:autoscaling:launchconfiguration"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SecurityGroups"
              - namespace = "aws:elb:loadbalancer"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "ServiceRole"
              - namespace = "aws:elasticbeanstalk:environment"
              - resource  = ""
              - value     = "AWSServiceRoleForElasticBeanstalk"
            },
          - {
              - name      = "ServiceRoleForManagedUpdates"
              - namespace = "aws:elasticbeanstalk:managedactions"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SpotFleetOnDemandAboveBasePercentage"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "70"
            },
          - {
              - name      = "SpotFleetOnDemandBase"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "0"
            },
          - {
              - name      = "SpotMaxPrice"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "StaticFiles"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "Statistic"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "Average"
            },
          - {
              - name      = "StreamLogs"
              - namespace = "aws:elasticbeanstalk:cloudwatch:logs"
              - resource  = ""
              - value     = "false"
            },
          - {
              - name      = "Subnets"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "SupportedArchitectures"
              - namespace = "aws:ec2:instances"
              - resource  = ""
              - value     = "x86_64"
            },
          - {
              - name      = "SystemType"
              - namespace = "aws:elasticbeanstalk:healthreporting:system"
              - resource  = ""
              - value     = "enhanced"
            },
          - {
              - name      = "Target"
              - namespace = "aws:elb:healthcheck"
              - resource  = ""
              - value     = "TCP:80"
            },
          - {
              - name      = "Timeout"
              - namespace = "aws:autoscaling:updatepolicy:rollingupdate"
              - resource  = ""
              - value     = "PT30M"
            },
          - {
              - name      = "Timeout"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "600"
            },
          - {
              - name      = "Timeout"
              - namespace = "aws:elb:healthcheck"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "UnhealthyThreshold"
              - namespace = "aws:elb:healthcheck"
              - resource  = ""
              - value     = "5"
            },
          - {
              - name      = "Unit"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "Bytes"
            },
          - {
              - name      = "UpdateLevel"
              - namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "UpperBreachScaleIncrement"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "1"
            },
          - {
              - name      = "UpperThreshold"
              - namespace = "aws:autoscaling:trigger"
              - resource  = ""
              - value     = "6000000"
            },
          - {
              - name      = "VPCId"
              - namespace = "aws:ec2:vpc"
              - resource  = ""
              - value     = ""
            },
          - {
              - name      = "WSGIPath"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "application"
            },
          - {
              - name      = "XRayEnabled"
              - namespace = "aws:elasticbeanstalk:xray"
              - resource  = ""
              - value     = "false"
            },
        ] -> null
      - application            = "eb-tf-app" -> null
      - arn                    = "arn:aws:elasticbeanstalk:us-east-1:196535069041:environment/eb-tf-app/eb-tf-env" -> null
      - autoscaling_groups     = [
          - "awseb-e-7cmu2vexj5-stack-AWSEBAutoScalingGroup-OSHVD539XJJZ",
        ] -> null
      - cname                  = "eb-tf-env.eba-h4erqrky.us-east-1.elasticbeanstalk.com" -> null
      - description            = "environment for flask app" -> null
      - endpoint_url           = "awseb-e-7-AWSEBLoa-11CPDO9ETV0PX-126741841.us-east-1.elb.amazonaws.com" -> null
      - id                     = "e-7cmu2vexj5" -> null
      - instances              = [
          - "i-075668f03df549bca",
        ] -> null
      - launch_configurations  = [
          - "awseb-e-7cmu2vexj5-stack-AWSEBAutoScalingLaunchConfiguration-ZjzQAuebv8TT",
        ] -> null
      - load_balancers         = [
          - "awseb-e-7-AWSEBLoa-11CPDO9ETV0PX",
        ] -> null
      - name                   = "eb-tf-env" -> null
      - platform_arn           = "arn:aws:elasticbeanstalk:us-east-1::platform/Python 3.7 running on 64bit Amazon Linux 2/3.3.12" -> null
      - queues                 = [] -> null
      - solution_stack_name    = "64bit Amazon Linux 2 v3.3.12 running Python 3.7" -> null
      - tags_all               = {} -> null
      - tier                   = "WebServer" -> null
      - triggers               = [] -> null
      - version_label          = "eb-tf-app-version-lable" -> null
      - wait_for_ready_timeout = "20m" -> null

      - setting {
          - name      = "IamInstanceProfile" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "aws-elasticbeanstalk-ec2-role" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elastic_beanstalk_environment.tfenv will be created
  + resource "aws_elastic_beanstalk_environment" "tfenv" {
      + all_settings           = (known after apply)
      + application            = "eb-tf-app"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + description            = "environment for flask app"
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "eb-tf-env"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v3.3.12 running Python 3.7"
      + tags_all               = (known after apply)
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = "eb-tf-app-version-lable"
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "aws-elasticbeanstalk-ec2-role"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "TFE_TOKEN" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

```
</details>
*Pusher: @JeisseRocha, Action: `pull_request`*